driver-tests/iepse/IEPRelationStream/RelationStreamApp/test/UnionInputB/template1.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:uni="UnionInputB.UnionInputB_iep">
  <soapenv:Body>
    <uni:StreamInput1_MsgObj>
      <LastName>${LastName.0}</LastName>
      <SInteger>${SInteger.0}</SInteger>
      <STimestamp>${STimestamp.0}</STimestamp>
    </uni:StreamInput1_MsgObj>
  </soapenv:Body>
</soapenv:Envelope>